{
  "backend/main.mo": "Main actor defining Product, CartItem, and Order types with functions for managing product catalog, shopping carts per principal, and order placement with total calculation.",
  "backend/migration.mo": "Migration module that transforms OldProduct to NewProduct by adding the isInstant field (defaulting to false) during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the instant delivery badge feature implementation in ProductCard.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, utilities, and configuration with focus on dairy business theme and instant delivery badge.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining farm-inspired color palette and design tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Kishan Dairy application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Home, Products, Cart, Checkout, and OrderSuccess, wrapped in CartProvider.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with quantity controls (increment/decrement), subtotal calculation, and remove functionality.",
  "frontend/src/components/DeliveryNotice.tsx": "Banner component with map pin icon displaying delivery area restriction notice for Sitamarhi, Bihar.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column layout showing business info, delivery area, contact details, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation links (Home, Products), and shopping cart button displaying item count badge.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component rendering Header, main content area via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, details, price, add-to-cart button, and conditional 'Instant' badge with lightning icon for products with isInstant=true.",
  "frontend/src/context/CartContext.tsx": "React context provider for cart state management, syncing with backend cart data and providing methods to add, update, remove items, and calculate totals.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state and identity persistence using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including fetching products, viewing cart, adding to cart, and placing orders with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a warm, earthy color scheme including light/dark mode support and typography settings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page component displaying cart items with quantity controls, order summary, and navigation to checkout or products page.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with form validation for customer details (name, phone, address) and order placement functionality with delivery notice.",
  "frontend/src/pages/Home.tsx": "Homepage component featuring a hero section with call-to-action, delivery notice, and three feature cards highlighting fresh products, quality assurance, and fast delivery.",
  "frontend/src/pages/OrderSuccess.tsx": "Order confirmation page displaying success message, next steps for order fulfillment, and navigation buttons to return home or continue shopping.",
  "frontend/src/pages/Products.tsx": "Product listing page that fetches and displays available dairy products in a grid layout with add-to-cart functionality and delivery notice.",
  "frontend/src/utils/images.ts": "Centralized exports for static image asset paths including product images, logo, and hero banner from the generated assets directory.",
  "frontend/src/utils/validation.ts": "Validation functions for customer input including name, Indian phone number format, and address verification requiring Sitamarhi/Bihar location.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, typography settings, border radius variables, and animation keyframes.",
  "project_state.json": "Project metadata tracking implemented features for Kishan Dairy e-commerce platform including homepage, product catalog, cart system, order placement, and delivery restrictions to Sitamarhi, Bihar."
}