{
  "backend/main.mo": "Motoko actor defining Product, CartItem, and Order types with functions to manage product catalog, shopping carts per user principal, and order placement with total calculation.",
  "feature_evidence.json": "Feature evidence report mapping requirements (homepage, delivery notice, product listing, cart, checkout, visual theme) to their implementing files and components with confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including styles, components, pages, utilities, and context providers for the dairy e-commerce application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining the earthy color palette and design tokens for the dairy shop theme.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Kishan Dairy' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Home, Products, Cart, Checkout, and OrderSuccess, wrapped in CartProvider for global cart state.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, name, price, quantity controls with increment/decrement buttons, subtotal calculation, and remove button.",
  "frontend/src/components/DeliveryNotice.tsx": "Prominent banner component with map pin icon displaying delivery restriction message for Sitamarhi, Bihar area only.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column layout showing business info, delivery area, contact section, copyright notice, and Caffeine.ai attribution link with UTM parameters.",
  "frontend/src/components/Header.tsx": "Sticky header with Kishan Dairy logo and branding, navigation links to Home and Products, and shopping cart button with item count badge.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component rendering Header, main content area with Outlet for nested routes, and Footer in a flex column structure.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component displaying product image, name, description, price per unit, and add to cart button with loading state support.",
  "frontend/src/context/CartContext.tsx": "React context provider for shopping cart state management, including cart items, add/update/remove operations, total calculation, and integration with backend queries via useViewCart and useAddToCart hooks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including fetching products, viewing cart, adding items to cart, and placing orders, all using the authenticated actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy color palette for light and dark modes, plus base styles for typography and layout.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page component displaying cart items with quantity controls, order summary with total calculation, and navigation to checkout or products page.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a form for customer details (name, phone, address) including validation, order summary display, and order placement via usePlaceOrder mutation.",
  "frontend/src/pages/Home.tsx": "Homepage component featuring a hero section with call-to-action, delivery notice, and three feature cards highlighting fresh products, quality assurance, and fast delivery for Kishan Dairy.",
  "frontend/src/pages/OrderSuccess.tsx": "Order confirmation page displaying success message, next steps for order fulfillment, and navigation buttons to return home or continue shopping.",
  "frontend/src/pages/Products.tsx": "Product listing page that fetches and displays available dairy products in a grid layout with add-to-cart functionality and delivery notice.",
  "frontend/src/utils/images.ts": "Exports constants for static image paths including product images (milk, curd, paneer, butter, ghee), logo, and hero banner.",
  "frontend/src/utils/validation.ts": "Validation functions for customer input: name (2-100 chars), Indian phone number (10 digits starting 6-9), and address (must include Sitamarhi/Bihar).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom design tokens for the dairy e-commerce theme.",
  "project_state.json": "Project metadata tracking implemented features for Kishan Dairy e-commerce platform, including homepage, product listing, cart system, order placement, and geographic delivery restrictions to Sitamarhi, Bihar."
}